# Exercise 4.9 - Part 1

# Table of Contents
1. Importing Data
2. Cleaning Data
3. Combining Data Sets
4. Changes from practice example

In [1]:
#importing libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r'C:\Users\jonsa\Documents\Instacart Basket Analysis'

In [3]:
df_cust = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'))

# 2. Cleaning Data

In [4]:
#Seeing how our data looks and column names

df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

#Renaming the column names be to easier to read in code

In [5]:
old_names = ['user_id', 'First Name', 'Surnam', 'Gender', 'STATE', 'Age', 'date_joined', 'n_dependants', 'fam_status', 'income']

In [6]:
new_names = ['user_id', 'first_name', 'last_name', 'gender', 'state', 'age', 'date_joined', 'num_of_dependants', 'marriage_status', 'income']

In [7]:
df_cust.rename(columns=dict(zip(old_names, new_names)), inplace=True)

In [8]:
#Checking to make sure the columns are correctly named

df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,num_of_dependants,marriage_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

**#Wrangling Data**

In [9]:
#Checking if any of our columns are mixed type

for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[weird]) > 0:
        print (col)

first_name

In [10]:
#Changing the first_name column to be all string types

df_cust['first_name'] = df_cust['first_name'].astype('str')

In [11]:
#Checking types of our other columns

df_cust.dtypes

user_id               int64
first_name           object
last_name            object
gender               object
state                object
age                   int64
date_joined          object
num_of_dependants     int64
marriage_status      object
income                int64
dtype: object

In [12]:
#Changing user_id column to string values

df_cust['user_id'] = df_cust['user_id'].astype('str')

In [13]:
#Checking for missing values, none found

df_cust.isnull().sum()

user_id              0
first_name           0
last_name            0
gender               0
state                0
age                  0
date_joined          0
num_of_dependants    0
marriage_status      0
income               0
dtype: int64

In [14]:
#Checking for duplicate rows, none found

df_cust_dups = df_cust[df_cust.duplicated()]

In [15]:
df_cust_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, num_of_dependants, marriage_status, income]
Index: []

**#No duplicates or missing values found in the data set**

In [16]:
#Exporting file as pickle

df_cust.to_pickle(os.path.join(path, 'Data', 'Prepared Data', 'customers_clean.pkl'))

# 3. Combining Data Sets

**#Combining Data sets**

In [17]:
#importing files

df_custs = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'customers_clean.pkl'))

In [18]:
ords_prods_merge = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'ords_prods_merge_flags.pkl'))

In [19]:
#Checking shape of the df_custs dataframe

df_custs.shape

(206209, 10)

In [20]:
df_custs.head()

,user_id,first_name,last_name,gender,state,age,date_joined,num_of_dependants,marriage_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [21]:
#Checking shape of the ords_prods_merge dataframe

ords_prods_merge.shape

(32404859, 25)

In [22]:
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_previous_order,only_order,product_id,add_to_cart_order,reordered,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,spending,spending_flag,order_frequency,frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Mid-range product,Regular busy day,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Mid-range product,Regular busy day,Slowest days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,False,196,1,1,...,Mid-range product,Regular busy day,Slowest days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Mid-range product,Least busy day,Slowest days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,False,196,1,1,...,Mid-range product,Least busy day,Slowest days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [23]:
#Checking data type of the user_id column in ords_prods_merge

ords_prods_merge['user_id'].dtype

dtype('int64')

In [24]:
#Changing the user_id type in ords_prods_merge to string to match the df_custs dataframe

ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [25]:
#Checking to ensure the code worked

ords_prods_merge['user_id'].dtypes

dtype('O')

In [26]:
#Merging the data sets

ords_prods_custs_merge = ords_prods_merge.merge(df_custs, on = 'user_id')

In [27]:
#Checking shape and columns

ords_prods_custs_merge.shape

(32404859, 34)

In [28]:
pd.options.display.max_columns = None
pd.options.display.max_rows = None
ords_prods_custs_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_previous_order,only_order,product_id,add_to_cart_order,reordered,_merge,product_name,aisle_id,department_id,prices,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,spending,spending_flag,order_frequency,frequency_flag,first_name,last_name,gender,state,age,date_joined,num_of_dependants,marriage_status,income
0,2539329,1,1,2,8,NaN,True,196,1,0,both,Soda,77,7,9.0,Mid-range product,Regular busy day,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,False,196,1,1,both,Soda,77,7,9.0,Mid-range product,Regular busy day,Slowest days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,False,196,1,1,both,Soda,77,7,9.0,Mid-range product,Regular busy day,Slowest days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,False,196,1,1,both,Soda,77,7,9.0,Mid-range product,Least busy day,Slowest days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,False,196,1,1,both,Soda,77,7,9.0,Mid-range product,Least busy day,Slowest days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

# 4. Changes from practice example

The changes made in the practice example for removing outliers from the price column did not save, adding here to save the trouble on next step

In [30]:
ords_prods_custs_merge['prices'].describe()

count    3.240486e+07
mean     1.198023e+01
std      4.956554e+02
min      1.000000e+00
25%      4.200000e+00
50%      7.400000e+00
75%      1.130000e+01
max      9.999900e+04
Name: prices, dtype: float64

In [32]:
ords_prods_custs_merge.loc[ords_prods_custs_merge['prices'] > 100, 'prices'] = np.nan

In [33]:
ords_prods_custs_merge['prices'].describe()

count    3.239973e+07
mean     7.790994e+00
std      4.241809e+00
min      1.000000e+00
25%      4.200000e+00
50%      7.400000e+00
75%      1.130000e+01
max      2.500000e+01
Name: prices, dtype: float64

**Exporting the files**

In [ ]:
ords_prods_custs_merge.to_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_customers_merged.pkl'))